import type { Dayjs } from "dayjs";

export interface OnThisDayEvent {
  year: number;
  description: string;
}

const ON_THIS_DAY: Record<string, OnThisDayEvent[]> = {
  "1-1": [
    {
      year: 1912,
      description: "孙中山在南京总统府宣誓就任中华民国临时大总统，中华民国成立。",
    },
    {
      year: 1979,
      description:
        "中华人民共和国政府和美利坚合众国政府相互承认并建立中美关系，同时美国与中华民国政府断交。",
    },
  ],
  "1-2": [
    {
      year: 1492,
      description: "卡斯提尔王国和亚拉冈王国军队攻陷格拉纳达酋长国，收复失地运动结束。",
    },
  ],
  "1-3": [
    {
      year: 1521,
      description: "教宗良十世发布教宗诏书《罗马宗座应该》，开除宗教改革家马丁·路德教籍。",
    },
    {
      year: 2009,
      description: "日裔美国人中本聪开发出首个比特币区块，并成功进行挖矿，获得50枚比特币。",
    },
  ],
  "1-4": [
    {
      year: 2004,
      description: "美国国家航空航天局火星探测漫游者计划中的精神号火星探测车在火星表面成功着陆。",
    },
  ],
  "1-5": [
    {
      year: 1975,
      description: "邓小平复出，开始整顿文化大革命。",
    },
    {
      year: 2005,
      description: "美国天文学家麦克·布朗团队分析帕洛马山天文台拍摄的照片，发现矮行星阋神星。",
    },
  ],
  "1-6": [
    {
      year: 1912,
      description: "德国地质学家阿尔弗雷德·韦格纳提出大陆漂移学说，后来被纳入板块构造论。",
    },
    {
      year: 1941,
      description:
        "美国总统富兰克林·德拉诺·罗斯福发表国情咨文，将“四大自由”视为世界各地人们的基本政治自由。",
    },
  ],
  "1-7": [
    {
      year: 1610,
      description: "意大利天文学家伽利略·伽利莱发现木卫一、木卫二、木卫三、木卫四四颗卫星。",
    },
  ],
  "1-8": [
    {
      year: 1959,
      description: "戴高乐就任法兰西第五共和国首任总统。",
    },
    {
      year: 1976,
      description: "中国总理周恩来于北京逝世。",
    },
  ],
  "1-9": [
    {
      year: 2007,
      description: "美国苹果公司执行长史蒂夫·乔布斯向公众发表初代iPhone。",
    },
  ],
  "1-10": [
    {
      year: 1946,
      description: "联合国大会在英国伦敦卫理公会中央礼堂召开首次会议，共计56个会员国代表参与。",
    },
  ],
  "1-11": [
    {
      year: 1943,
      description: "中国与英国和美国分别签署平等新约，废除两国在中国的治外法权。",
    },
  ],
  "1-12": [
    {
      year: 2010,
      description: "海地首都太子港附近发生ML 7.0地震，造成超过10万人死亡、300多万人受伤。",
    },
  ],
  "1-13": [
    {
      year: 1993,
      description: "禁止化学武器公约签订。",
    },
  ],
  "1-14": [
    {
      year: 1793,
      description: "美国独立战争正式结束。",
    },
    {
      year: 2005,
      description: "欧洲空间局惠更斯号探测器登陆土卫六，创造了探测器登陆其它星球最远距离的新记录。",
    },
  ],
  "1-15": [
    {
      year: 2001,
      description: "美国企业家吉米·威尔斯和拉里·桑格推出采用Wiki技术的维基百科计划。",
    },
    {
      year: 2009,
      description:
        "美国全美航空机长切斯利·萨伦伯格驾驶遭到鸟击的全美航空1549号班机成功迫降于纽约哈得孙河。",
    },
  ],
  "1-16": [
    {
      year: 2006,
      description: "利比里亚团结党领袖埃伦·约翰逊·瑟利夫就任总统，为非洲国家首位民选女性总统。",
    },
  ],
  "1-17": [
    {
      year: 1991,
      description: "在联合国授权下，以美国为首的多国部队对入侵科威特的伊拉克军队发动空袭。",
    },
    {
      year: 1995,
      description:
        "日本神户市淡路岛近岸发生Mj7.3的强烈地震，造成超过6,000多人死亡和10兆日圆的损失。",
    },
  ],
  "1-18": [
    {
      year: 1919,
      description: "协约国在法国凡尔赛宫召开巴黎和会，并和同盟国签订一系列和平条约。",
    },
    {
      year: 2005,
      description: "空中客车A380在法国面世。",
    },
  ],
  "1-19": [
    {
      year: 1983,
      description: "苹果公司推出Apple Lisa电脑，为全球第一款采用图形用户界面的商品化个人电脑。",
    },
  ],
  "1-20": [
    {
      year: 1892,
      description: "美国基督教青年会在纽约州首府奥尔巴尼举办首次正式的篮球比赛。",
    },
    {
      year: 2009,
      description: "第一个非裔美国人总统贝拉克·奥巴马宣誓就任第44任美国总统。",
    },
  ],
  "1-21": [
    {
      year: 1793,
      description: "法国国民公会判处国王路易十六犯下背叛国家罪，并在革命广场斩首处决。",
    },
    {
      year: 1976,
      description: "协和号客机开通英国航空和法国航空的定期航班服务，首次投入商业飞行。",
    },
  ],
  "1-22": [
    {
      year: 1901,
      description: "英国维多利亚女王去世，其长子爱德华七世继承王位。",
    },
    {
      year: 1973,
      description:
        "美国最高法院针对罗诉韦德案做出重大裁定，要求对妇女堕胎权的限制应该采取严格审查标准。",
    },
  ],
  "1-23": [
    {
      year: 1556,
      description: "中国陕西布政司发生史上死亡人数最多的强烈地震，造成约83万人死亡。",
    },
  ],
  "1-24": [
    {
      year: 1848,
      description: "美国木匠詹姆斯·W·马歇尔在加利福尼亚州锯木厂发现砂金，其后引发淘金潮。",
    },
    {
      year: 1984,
      description: "美国苹果公司推出个人电脑Macintosh 128K，为第一款麦金塔系列电脑。",
    },
  ],
  "1-25": [
    {
      year: 1327,
      description: "在英格兰国会废黜爱德华二世后，其子爱德华三世被拥立成为英格兰国王。",
    },
    {
      year: 1949,
      description: "电视艺术及科学学院颁发第一届艾美奖，以表扬美国电视工业中的杰出人士和节目。",
    },
  ],
  "1-26": [
    {
      year: 1291,
      description: "忽必烈命令郭守敬开凿通惠河。",
    },
    {
      year: 1841,
      description: "查理·义律和伯麦率领英国军队在水坑口登陆香港岛，宣示正式占领香港。",
    },
  ],
  "1-27": [
    {
      year: 1888,
      description: "美国《国家地理杂志》的出版者国家地理学会在华盛顿成立。",
    },
    {
      year: 1973,
      description: "美国、南越、北越和越共签署《巴黎和平协约》，达成越南南部临时停火。",
    },
  ],
  "1-28": [
    {
      year: 1932,
      description:
        "日本皇军由上海租界向闸北一带进攻，遇到中国国民革命军第十九路军的抵抗，一二八事变爆发。",
    },
    {
      year: 1986,
      description: "美国挑战者号航天飞机在发射升空73秒后爆炸解体，造成7名太空人死亡。",
    },
  ],
  "1-30": [
    {
      year: 1933,
      description: "德国总统保罗·冯·兴登堡任命阿道夫·希特勒为总理，标志着纳粹党开始掌权。",
    },
    {
      year: 1948,
      description: "印度国民大会党领袖圣雄甘地遭到印度教信徒南度蓝姆·高德西枪击死亡。",
    },
  ],
  "1-31": [
    {
      year: 1968,
      description:
        "美国驻西贡大使馆遭到越南民族解放阵线（越共）夜袭，18名越南敢死队员及美陆军宪兵4人、守馆海军陆战队卫兵1人在激战一夜中死亡。",
    },
  ],
  "2-1": [
    {
      year: 1662,
      description: "荷兰东印度公司台湾长官揆一向郑成功军队投降，结束荷兰在台湾的经营。",
    },
    {
      year: 2003,
      description: "美国哥伦比亚号航天飞机在德克萨斯州上空爆炸解体，造成7名宇航员死亡。",
    },
  ],
  "2-2": [
    {
      year: 1920,
      description: "爱沙尼亚同苏联签订和约并宣布独立。",
    },
    {
      year: 1943,
      description: "德国元帅弗里德里希·包路斯的第6军团向苏联红军投降，斯大林格勒战役结束。",
    },
  ],
  "2-3": [
    {
      year: 1488,
      description:
        "葡萄牙航海家巴尔托洛梅乌·迪亚士船队在莫塞尔湾登陆，为首支绕过非洲好望角的欧洲船队。",
    },
    {
      year: 1966,
      description:
        "苏联太空探测器月球9号成功降落在月球表面上，成为首颗在月球软着陆的机器人太空载具。",
    },
  ],
  "2-4": [
    {
      year: 1945,
      description: "美国、英国、苏联三国领袖在克里米亚举行雅尔达会议，形成雅尔塔体系。",
    },
    {
      year: 1975,
      description: "中国大陆辽宁省海城地震。",
    },
  ],
  "5-23": [
    {
      year: 1995,
      description: "加拿大软件专家詹姆斯·高斯林及其太阳微系统同事正式开发出编程语言Java。",
    },
  ],
  "12-13": [
    {
      year: 1937,
      description: "日本军队成功攻占中华民国首都南京市，并在未来数星期内展开各式反人类战争罪行。",
    },
    {
      year: 2003,
      description: "美军寻获前伊拉克总统萨达姆·侯赛因在提克里特的藏身处，并发起行动将其俘虏。",
    },
  ],
  "12-26": [
    {
      year: 1893,
      description: "中国共产主义革命家、首任中国共产党中央委员会主席毛泽东出生。",
    },
  ],
  "12-29": [
    {
      year: 1911,
      description:
        "中华民国临时大总统选举，孙中山以16票当选中华民国临时大总统，黎元洪以17票当选中华民国临时副总统。",
    },
    {
      year: 1996,
      description:
        "危地马拉总统阿尔瓦罗·恩里克·阿尔苏·伊里戈延与反政府游击队签署和平协议，结束长达36年的内战。",
    },
  ],
  "12-30": [
    {
      year: 1922,
      description: "蘇維埃俄國、烏克蘭、白俄羅斯、外高加索聯邦正式簽署《蘇聯成立條約》而組成蘇聯。",
    },
  ],
  "12-31": [
    {
      year: 1999,
      description: "鲍利斯·叶利钦宣布辞去俄罗斯总统，总理弗拉基米尔·普京受命成为代理总统。",
    },
    {
      year: 2004,
      description: "台湾台北市信义区的台北101大楼正式启用，为当时世界上最高的摩天大楼。",
    },
  ],
};

export function getOnThisDayEvents(date: Dayjs): OnThisDayEvent[] {
  return ON_THIS_DAY[date.format("M-D")] || [];
}
