import type { Dayjs } from "dayjs";

export interface OnThisDayEvent {
  year: number;
  description: string;
}

const ON_THIS_DAY: Record<string, OnThisDayEvent[]> = {
  "1-1": [
    {
      year: 1912,
      description: "孙中山在南京总统府宣誓就任中华民国临时大总统，中华民国成立。",
    },
    {
      year: 1979,
      description:
        "中华人民共和国政府和美利坚合众国政府相互承认并建立中美关系，同时美国与中华民国政府断交。",
    },
  ],
  "1-2": [
    {
      year: 1912,
      description:
        "孙中山通令中国各省都督：各省代表团决议中华民国改用阳历，以黄帝纪元四千六百九年十一月十三日为中华民国元年元旦。",
    },
  ],
  "1-3": [
    {
      year: 1521,
      description: "教宗良十世发布教宗诏书《罗马宗座应该》，开除宗教改革家马丁·路德教籍。",
    },
    {
      year: 2009,
      description: "日裔美国人中本聪开发出首个比特币区块，并成功进行挖矿，获得50枚比特币。",
    },
  ],
  "1-5": [
    {
      year: 1975,
      description: "邓小平复出，开始整顿文化大革命。",
    },
  ],
  "1-6": [
    {
      year: 1912,
      description: "德国地质学家阿尔弗雷德·韦格纳提出大陆漂移学说，后来被纳入板块构造论。",
    },
    {
      year: 1941,
      description:
        "美国总统富兰克林·德拉诺·罗斯福发表国情咨文，将“四大自由”视为世界各地人们的基本政治自由。",
    },
  ],
  "1-7": [
    {
      year: 1610,
      description: "意大利天文学家伽利略·伽利莱发现木卫一、木卫二、木卫三、木卫四四颗卫星。",
    },
  ],
  "1-8": [
    {
      year: 1959,
      description: "戴高乐就任法兰西第五共和国首任总统。",
    },
    {
      year: 1976,
      description: "中国总理周恩来于北京逝世。",
    },
  ],
  "1-9": [
    {
      year: 2007,
      description: "美国苹果公司执行长史蒂夫·乔布斯向公众发表初代iPhone。",
    },
  ],
  "1-10": [
    {
      year: 1946,
      description: "联合国大会在英国伦敦卫理公会中央礼堂召开首次会议，共计56个会员国代表参与。",
    },
  ],
  "1-11": [
    {
      year: 1943,
      description: "中国与英国和美国分别签署平等新约，废除两国在中国的治外法权。",
    },
  ],
  "1-13": [
    {
      year: 1993,
      description: "禁止化学武器公约签订。",
    },
  ],
  "1-14": [
    {
      year: 1793,
      description: "美国独立战争正式结束。",
    },
  ],
  "1-15": [
    {
      year: 2001,
      description: "美国企业家吉米·威尔斯和拉里·桑格推出采用Wiki技术的维基百科计划。",
    },
  ],
  "1-16": [
    {
      year: 2006,
      description: "利比里亚团结党领袖埃伦·约翰逊·瑟利夫就任总统，为非洲国家首位民选女性总统。",
    },
  ],
  "1-17": [
    {
      year: 1991,
      description: "在联合国授权下，以美国为首的多国部队对入侵科威特的伊拉克军队发动空袭。",
    },
  ],
  "1-18": [
    {
      year: 1919,
      description: "协约国在法国凡尔赛宫召开巴黎和会，并和同盟国签订一系列和平条约。",
    },
  ],
  "1-19": [
    {
      year: 1983,
      description: "苹果公司推出Apple Lisa电脑，为全球第一款采用图形用户界面的商品化个人电脑。",
    },
  ],
  "1-20": [
    {
      year: 2009,
      description: "第一个非裔美国人总统贝拉克·奥巴马宣誓就任第44任美国总统。",
    },
  ],
  "1-21": [
    {
      year: 1793,
      description: "法国国民公会判处国王路易十六犯下背叛国家罪，并在革命广场斩首处决。",
    },
  ],
  "1-22": [
    {
      year: 1901,
      description: "英国维多利亚女王去世，其长子爱德华七世继承王位。",
    },
    {
      year: 1973,
      description:
        "美国最高法院针对罗诉韦德案做出重大裁定，要求对妇女堕胎权的限制应该采取严格审查标准。",
    },
  ],
  "1-23": [
    {
      year: 1556,
      description: "中国陕西布政司发生史上死亡人数最多的强烈地震，造成约83万人死亡。",
    },
  ],
  "1-24": [
    {
      year: 1848,
      description: "美国木匠詹姆斯·W·马歇尔在加利福尼亚州锯木厂发现砂金，其后引发淘金潮。",
    },
    {
      year: 1984,
      description: "美国苹果公司推出个人电脑Macintosh 128K，为第一款麦金塔系列电脑。",
    },
  ],
  "1-25": [
    {
      year: 1327,
      description: "在英格兰国会废黜爱德华二世后，其子爱德华三世被拥立成为英格兰国王。",
    },
  ],
  "1-26": [
    {
      year: 1291,
      description: "忽必烈命令郭守敬开凿通惠河。",
    },
    {
      year: 1841,
      description: "查理·义律和伯麦率领英国军队在水坑口登陆香港岛，宣示正式占领香港。",
    },
  ],
  "1-27": [
    {
      year: 1973,
      description: "美国、南越、北越和越共签署《巴黎和平协约》，达成越南南部临时停火。",
    },
  ],
  "1-28": [
    {
      year: 1932,
      description:
        "日本皇军由上海租界向闸北一带进攻，遇到中国国民革命军第十九路军的抵抗，一二八事变爆发。",
    },
  ],
  "1-30": [
    {
      year: 1933,
      description: "德国总统保罗·冯·兴登堡任命阿道夫·希特勒为总理，标志着纳粹党开始掌权。",
    },
    {
      year: 1948,
      description: "印度国民大会党领袖圣雄甘地遭到印度教信徒南度蓝姆·高德西枪击死亡。",
    },
  ],
  "2-1": [
    {
      year: 1662,
      description: "荷兰东印度公司台湾长官揆一向郑成功军队投降，结束荷兰在台湾的经营。",
    },
  ],
  "2-2": [
    {
      year: 1943,
      description: "德国元帅弗里德里希·包路斯的第6军团向苏联红军投降，斯大林格勒战役结束。",
    },
  ],
  "2-3": [
    {
      year: 1488,
      description:
        "葡萄牙航海家巴尔托洛梅乌·迪亚士船队在莫塞尔湾登陆，为首支绕过非洲好望角的欧洲船队。",
    },
  ],
  "2-4": [
    {
      year: 1945,
      description: "美国、英国、苏联三国领袖在克里米亚举行雅尔达会议，形成雅尔塔体系。",
    },
    {
      year: 1975,
      description: "中国大陆辽宁省海城地震。",
    },
  ],
  "2-6": [
    {
      year: 1952,
      description: "英国女王伊丽莎白二世登基。",
    },
  ],
  "2-11": [
    {
      year: 2003,
      description: "中国广东爆发非典型肺炎（SARS），此后不断蔓延，并影响香港及海外。",
    },
  ],
  "2-12": [
    {
      year: 1138,
      description: "金国颁布女真文字。",
    },
    {
      year: 1912,
      description: "摄政皇太后隆裕太后代表末代皇帝溥仪颁布退位诏书，结束清朝的统治。",
    },
  ],
  "2-13": [
    {
      year: 1875,
      description: "日本政府发布《平民苗字必称义务令》，正式规范所有人民必须使用姓氏。",
    },
  ],
  "2-14": [
    {
      year: 1946,
      description: "世界第一台通用电子计算机埃尼阿克在美国费城正式向外界公布。",
    },
    {
      year: 1950,
      description: "中苏友好同盟互助条约在莫斯科签订。",
    },
  ],
  "2-16": [
    {
      year: 1923,
      description: "英国考古学家霍华德·卡特团队打开埃及第十八王朝法老图坦卡门的坟墓KV62。",
    },
    {
      year: 1946,
      description: "在推翻富尔亨西奥·巴蒂斯塔政权后，菲德尔·卡斯特罗出任古巴共和国总理。",
    },
  ],
  "2-17": [
    {
      year: 1979,
      description: "中国人民解放军从云南省、广西壮族自治区攻入越南北部，中越战争爆发。",
    },
  ],
  "2-18": [
    {
      year: 1930,
      description: "美国天文学家克莱德·汤博在罗威尔天文台发现冥王星，将其视为第九大行星。",
    },
  ],
  "2-20": [
    {
      year: 1897,
      description: "大清邮政在北京开办。",
    },
  ],
  "2-21": [
    {
      year: 1848,
      description: "卡尔·马克思和弗里德里希·恩格斯在英国伦敦匿名发表《共产党宣言》。",
    },
    {
      year: 1972,
      description: "美国总统尼克松正式访问中华人民共和国。",
    },
  ],
  "2-22": [
    {
      year: 1799,
      description: "清朝皇帝嘉庆帝宣布前军机大臣和珅犯下二十条大罪，赐其在家中自尽。",
    },
  ],
  "2-23": [
    {
      year: 1455,
      description: "德国发明家约翰尼斯·谷腾堡完成第一批以活字印刷术量产的《谷腾堡圣经》。",
    },
    {
      year: 1886,
      description: "美国发明家查尔斯·马丁·霍尔发现一种价格低廉的制铝方法。",
    },
  ],
  "2-24": [
    {
      year: 1582,
      description: "教宗额我略十三世颁布新的历法格里历，即现行国际通行的公历。",
    },
    {
      year: 1920,
      description: "阿道夫·希特勒在德国慕尼黑宣读《二十五点纲领》，德国工人党正式更名为纳粹党。",
    },
  ],
  "2-25": [
    {
      year: 645,
      description: "中国唐朝佛教僧侣玄奘自印度学成归国，回到京城长安。",
    },
  ],
  "2-27": [
    {
      year: 1641,
      description: "李自成率军攻克洛阳，杀福王朱常洵，并煮成肉汤与手下将士们共享。",
    },
    {
      year: 1996,
      description: "由游戏公司Game Freak开发的《宝可梦 红／绿》在日本发售，为该系列首部作品。",
    },
  ],
  "2-29": [
    {
      year: 632,
      description: "中国唐朝开设律学，培养法律人才。",
    },
  ],
  "3-1": [
    {
      year: 138,
      description: "张衡研制的候风地动仪观测到陇西发生地震。",
    },
  ],
  "3-8": [
    {
      year: 1911,
      description: "首次三八妇女节。",
    },
  ],
  "4-27": [
    {
      year: 1911,
      description: "同盟会发动黄花岗起义。",
    },
  ],
  "5-23": [
    {
      year: 1995,
      description: "加拿大软件专家詹姆斯·高斯林及其太阳微系统同事正式开发出编程语言Java。",
    },
  ],
  "8-3": [
    {
      year: 1923,
      description: "鲁迅出版小说集《呐喊》。",
    },
  ],
  "8-5": [
    {
      year: 1582,
      description:
        "应召前往中华传教的意大利教士利玛窦，到达广州香山澳（澳门），开始了天主教与西学在广州的首次传播。",
    },
  ],
  "12-13": [
    {
      year: 1937,
      description: "日本军队成功攻占中华民国首都南京市，并在未来数星期内展开各式反人类战争罪行。",
    },
    {
      year: 2003,
      description: "美军寻获前伊拉克总统萨达姆·侯赛因在提克里特的藏身处，并发起行动将其俘虏。",
    },
  ],
  "12-26": [
    {
      year: 1893,
      description: "中国共产主义革命家、首任中国共产党中央委员会主席毛泽东出生。",
    },
  ],
  "12-29": [
    {
      year: 1911,
      description:
        "中华民国临时大总统选举，孙中山以16票当选中华民国临时大总统，黎元洪以17票当选中华民国临时副总统。",
    },
    {
      year: 1996,
      description:
        "危地马拉总统阿尔瓦罗·恩里克·阿尔苏·伊里戈延与反政府游击队签署和平协议，结束长达36年的内战。",
    },
  ],
  "12-30": [
    {
      year: 1922,
      description: "蘇維埃俄國、烏克蘭、白俄羅斯、外高加索聯邦正式簽署《蘇聯成立條約》而組成蘇聯。",
    },
  ],
  "12-31": [
    {
      year: 1999,
      description: "鲍利斯·叶利钦宣布辞去俄罗斯总统，总理弗拉基米尔·普京受命成为代理总统。",
    },
    {
      year: 2004,
      description: "台湾台北市信义区的台北101大楼正式启用，为当时世界上最高的摩天大楼。",
    },
  ],
};

export function getOnThisDayEvents(date: Dayjs): OnThisDayEvent[] {
  return ON_THIS_DAY[date.format("M-D")] || [];
}
